#+title: Tutorial: Build and Run a Static Site with Railpack and Podman
#+author: Xavier Brinon
#+date: [2026-03-26 Thu]
#+startup: indent
#+options: toc:t num:t ^:{}

* Step 1: Install Podman

#+begin_src bash
  brew install podman
#+end_src

#+begin_example
==> Downloading ...
==> Installing podman
🍺  /opt/homebrew/Cellar/podman/5.8.1
#+end_example

Initialise and start the Podman machine (a lightweight Linux VM that runs
containers):

#+begin_src bash
  podman machine init
  podman machine start
#+end_src

#+begin_example
Machine init complete
...
Machine "podman-machine-default" started successfully
#+end_example

If the machine is already initialised or running, you will see a message saying
so --- that is fine.

Verify Podman works:

#+name: podman version
#+begin_src bash
  podman --version
#+end_src

#+RESULTS: podman version
: podman version 5.8.1

